Importing libreries

In [1]:
import pandas as pd
import random as rnd
import numpy as np

## For sheet_1 , Patient Record
import dataset format

In [2]:
dt=pd.DataFrame()
dt["Sr. No."]=[i for i in range(1,5001)]
dt.tail()

      Sr. No.
4995     4996
4996     4997
4997     4998
4998     4999
4999     5000

#### PatientId

In [3]:
pid=[]
for i in range(1,5001):
    j=str(i)
    if len(j)<4:
        j="0"*(4-len(j))+j
    pid.append("RajMah"+j)
dt["Patient Id"]=pid
dt.tail()

      Sr. No.  Patient Id
4995     4996  RajMah4996
4996     4997  RajMah4997
4997     4998  RajMah4998
4998     4999  RajMah4999
4999     5000  RajMah5000

#### Name of Patient
importing names from <b>Gender_final.xlsx</b>

In [4]:
nams=pd.read_excel("DataSets/Gender_final.xlsx")
nams

                   name gender    race
0               barjraj      m  indian
1          ramdin verma      m  indian
2       sharat chandran      m  indian
3       birender mandal      m  indian
4                  amit      m  indian
...                 ...    ...     ...
123524            Zulfa      f  indian
123525          Zumruda      f  indian
123526          Zunaira      f  indian
123527            Zunni      f  indian
123528         Zykaraya      f  indian

[123529 rows x 3 columns]

Converting <b>name</b> field to list

In [5]:
nms=nams["name"].to_list()
# nms

Cleaning the Name data

In [6]:
pr_nams=[]

spchr='abcdefghijklmnopqrstuvwxyz ABCDEFGHIJKLMNOPQRSTUVWXYZ'
for i in nms:
    i=str(i)
    invali=[j for j in i if j not in spchr]
    if(len(invali)>0):
        continue
    wrds=i.split(" ")
    if(len(wrds)>1):
        i=" ".join([l.capitalize() for l in wrds])
        pr_nams.append(i)
pr_nams=np.array(pr_nams)
len(pr_nams)

12204

Sampling 5000 names from name

In [7]:
names=np.random.choice(np.array(pr_nams),size=5000)
names

array(['Raju Kumar', 'Ankit Goyel', 'Rahul Vijay', ..., 'Dwaraka Das',
       'Suman Devi', 'Shiv Kumar'], dtype='<U49')

Assigning <b>Name of Patient</b> field

In [8]:
dt["Name of Patient"]=names
dt.tail()

      Sr. No.  Patient Id Name of Patient
4995     4996  RajMah4996   Preyojit Nath
4996     4997  RajMah4997     Manoj Kumar
4997     4998  RajMah4998     Dwaraka Das
4998     4999  RajMah4999      Suman Devi
4999     5000  RajMah5000      Shiv Kumar

#### Contact No.
Generating Mobile numbers

In [9]:
mbl=["+91"+str(rnd.randint(6,9))+"".join([str(rnd.randint(0,9)) for i in range(9)]) for i in range(5000)]
mbl[:4]

['+916668213076', '+919360745357', '+916121615026', '+917758315081']

Formatting Mobile numbers with spaces

In [10]:
mob=[]
for i in mbl:
    t=i[:3]+" "+i[3:8]+" "+i[8:]
    mob.append(t)
mob[0]

'+91 66682 13076'

Assigning <b>Contact No.</b>

In [11]:
dt["Contact No."]=mob
dt.head()

   Sr. No.  Patient Id Name of Patient      Contact No.
0        1  RajMah0001      Raju Kumar  +91 66682 13076
1        2  RajMah0002     Ankit Goyel  +91 93607 45357
2        3  RajMah0003     Rahul Vijay  +91 61216 15026
3        4  RajMah0004        Uthmaa N  +91 77583 15081
4        5  RajMah0005   Sushree Veena  +91 99797 81590

#### Adhar ID
Generating Adhar numbers

In [12]:
adhr=[str(rnd.randint(1,9))+"".join([str(rnd.randint(0,9)) for i in range(11)]) for j in range(5000)]
adhr[0]

'421006428945'

Formatting Adhar numbers with spaces

In [13]:
adhar=[]
for i in adhr:
    t=i[:4]+" "+i[4:8]+" "+i[8:]
    adhar.append(t)
adhar[3]

'9162 6629 1337'

Assigning <b>Adhar ID</b>

In [14]:
dt["Adhar ID"]=adhar
dt.head()

   Sr. No.  Patient Id Name of Patient      Contact No.        Adhar ID
0        1  RajMah0001      Raju Kumar  +91 66682 13076  4210 0642 8945
1        2  RajMah0002     Ankit Goyel  +91 93607 45357  9350 5313 7766
2        3  RajMah0003     Rahul Vijay  +91 61216 15026  8143 1714 4772
3        4  RajMah0004        Uthmaa N  +91 77583 15081  9162 6629 1337
4        5  RajMah0005   Sushree Veena  +91 99797 81590  2386 9495 6304

Saving the updated Dataset at <b>Patient Record_5000.xlsx</b>

In [15]:
dt.to_excel("DataSets/Patient Record_5000.xlsx",sheet_name="Patient Record",index=False)

#### DOB
##### Date of Birth Between January 2020 to December 2023 
List all dates range from <b>March 1, 2022</b> to <b>July 29, 2023</b><br>
And then sampling 5000 dates

In [16]:
dates=pd.date_range(start='3/1/2020', end='7/29/2023',freq="d").astype(str).to_list()
dob=np.random.choice(dates,size=5000)
dob

array(['2022-05-04', '2021-03-08', '2023-07-26', ..., '2020-04-19',
       '2020-05-07', '2022-05-04'], dtype='<U10')

Assignigning DOB

In [17]:
dt["DOB"]=dob
dt.head()

,Sr. No.,Patient Id,Name of Patient,Contact No.,Adhar ID,DOB
0,1,RajMah0001,Raju Kumar,+91 66682 13076,4210 0642 8945,2022-05-04
1,2,RajMah0002,Ankit Goyel,+91 93607 45357,9350 5313 7766,2021-03-08
2,3,RajMah0003,Rahul Vijay,+91 61216 15026,8143 1714 4772,2023-07-26
3,4,RajMah0004,Uthmaa N,+91 77583 15081,9162 6629 1337,2022-01-12
4,5,RajMah0005,Sushree Veena,+91 99797 81590,2386 9495 6304,2023-03-05

Saving the file

In [18]:
dt.to_excel("DataSets/Patient Record_5000.xlsx",sheet_name="Patient Record",index=False)

Formatting <b>DOB</b> field as <b>day-month-year</b>

In [19]:
dob = dt["DOB"].to_list()
dob1=[]
for i in dob:
    dob1.append("-".join(i.split("-")[::-1]))
dt["DOB"]=dob1
dt.head()

,Sr. No.,Patient Id,Name of Patient,Contact No.,Adhar ID,DOB
0,1,RajMah0001,Raju Kumar,+91 66682 13076,4210 0642 8945,04-05-2022
1,2,RajMah0002,Ankit Goyel,+91 93607 45357,9350 5313 7766,08-03-2021
2,3,RajMah0003,Rahul Vijay,+91 61216 15026,8143 1714 4772,26-07-2023
3,4,RajMah0004,Uthmaa N,+91 77583 15081,9162 6629 1337,12-01-2022
4,5,RajMah0005,Sushree Veena,+91 99797 81590,2386 9495 6304,05-03-2023

#### Address
For <b>Address</b> field, 4 areas are randomly selected
<ol>
    <li>Rajura</li>
    <li>Aheri</li>
    <li>Gadchiroli</li>
    <li>Etapalli</li>
    <li>Sironcha</li>
    <li>Bamni</li>
    <li>digras</li>
    <li>Karanja</li>
    <li>Tarsa</li>
    <li>Itaba</li>
</ol>

In [20]:
area = ["Rajura","Aheri","Gadchiroli","Etapalli","Sironcha","Bamni","digras","Karanja","Tarsa","Itaba"]
addr=rnd.choices(area,k=5000)
dt["Address"]=addr
dt.tail()

,Sr. No.,Patient Id,Name of Patient,Contact No.,Adhar ID,DOB,Address
4995,4996,RajMah4996,Preyojit Nath,+91 80342 13225,3103 9079 0611,21-02-2022,Aheri
4996,4997,RajMah4997,Manoj Kumar,+91 88134 31732,2228 9017 1221,17-04-2022,Bamni
4997,4998,RajMah4998,Dwaraka Das,+91 72870 21157,3921 7528 2136,19-04-2020,digras
4998,4999,RajMah4999,Suman Devi,+91 71513 42502,1308 4638 3481,07-05-2020,Etapalli
4999,5000,RajMah5000,Shiv Kumar,+91 89100 89849,9653 3279 3777,04-05-2022,Etapalli

Saving the updated dataset at <b>Patient Record_5000.xlsx</b>

In [21]:
dt.to_excel("DataSets/Patient Record_5000.xlsx",sheet_name="Patient Record",index=False)

## For sheet_2 , Measuring Parameter

Creating a dataFrame with <b>Sr. No.</b> field of 1st sheet dataframe

In [22]:
dt2=pd.DataFrame({"Sr. No.":dt["Sr. No."]})
dt2.tail()

      Sr. No.
4995     4996
4996     4997
4997     4998
4998     4999
4999     5000

#### Date
##### Date of 1st visit August 2023 to December 2023 
List all dates range from <b>August 13, 2023</b> to <b>December 25, 2023</b><br>
And then sampling 50 dates <br>And then sort it

In [23]:
m_dats=pd.bdate_range(start="8/13/2023",end="12/30/2023").to_list()
# m_dats=pd.bdate_range(start="9/9/2023",end="11/4/2023").to_list()
mes_ds=pd.Series(np.random.choice(m_dats,size=5000)).sort_values()
mes_dates=[str(i).split(" ")[0] for i in mes_ds]

# mes_dates

Assigning <b>Date</b> field

In [24]:
dt2.loc[:,"Date"]=mes_dates
dt2.tail()

      Sr. No.        Date
4995     4996  2023-12-29
4996     4997  2023-12-29
4997     4998  2023-12-29
4998     4999  2023-12-29
4999     5000  2023-12-29

#### Time
Time of to measurement in the same day should not be same, Let's find duplicated dates

In [25]:
# dat_dup=dt2["Date"].duplicated(keep="first")
# dat_dup.value_counts()

In [26]:
tdf = pd.DataFrame()
tdf["Date"] = dt2["Date"]
tdf["Area"] = dt["Address"]
# tdf["Area"] = dt["Address"]
tdf.head()

         Date    Area
0  2023-08-14  Rajura
1  2023-08-14  Rajura
2  2023-08-14   Tarsa
3  2023-08-14   Aheri
4  2023-08-14   Tarsa

In [27]:
tdf1 = tdf.value_counts().reset_index(name='count').sort_values('Date')
# cnt = tdf1[tdf1['count']>0]
tdf1['count'].max(),tdf1

(13,
            Date        Area  count
 488  2023-08-14       Bamni      5
 274  2023-08-14      Rajura      6
 701  2023-08-14  Gadchiroli      4
 489  2023-08-14       Aheri      5
 736  2023-08-14    Sironcha      3
 ..          ...         ...    ...
 732  2023-12-29     Karanja      3
 731  2023-12-29      Rajura      3
 54   2023-12-29    Etapalli      9
 425  2023-12-29       Aheri      5
 55   2023-12-29       Bamni      9

 [992 rows x 3 columns])

Get a list of all times in a day differ by 1 min.

In [28]:
mes_tym=pd.date_range(start="10:00",end="12:50",freq="1min").append(pd.date_range(start="14:15",end="15:55",freq="1min"))

mes_tym=[str(i).split(" ")[1][:-3] for i in mes_tym]
# mes_tym

Checking duplicated values i.e data having same date

In [29]:
# dat_dup.value_counts()

Creating a temperarty dataframe to find data having same date and same Address

In [30]:
# pd.unique(tdf)

Creating a new variable <b>mes_time</b> which have the same length of dataset(5000) and assign some value to it , here i copied dat_dup.</br>

Assign sorted random sample of <b>bussiness times(var mes_tym)<b/> same number as the counted continuous True values in dat_dup

In [31]:
tdf1

           Date        Area  count
488  2023-08-14       Bamni      5
274  2023-08-14      Rajura      6
701  2023-08-14  Gadchiroli      4
489  2023-08-14       Aheri      5
736  2023-08-14    Sironcha      3
..          ...         ...    ...
732  2023-12-29     Karanja      3
731  2023-12-29      Rajura      3
54   2023-12-29    Etapalli      9
425  2023-12-29       Aheri      5
55   2023-12-29       Bamni      9

[992 rows x 3 columns]

In [32]:
dt2["Time"]=np.nan
dt2.head()

   Sr. No.        Date  Time
0        1  2023-08-14   NaN
1        2  2023-08-14   NaN
2        3  2023-08-14   NaN
3        4  2023-08-14   NaN
4        5  2023-08-14   NaN

In [33]:
dt2.isna().sum()

Sr. No.       0
Date          0
Time       5000
dtype: int64

In [40]:
for i in tdf1.values:
    tmm=pd.Series(np.random.choice(mes_tym[::rnd.randint(10,17)], i[-1], replace=False)).sort_values().to_list()

    dt2.loc[ (dt2['Date'] == i[0]) & (tdf["Area"] == i[1]), "Time"] = tmm
dt2.head()

   Sr. No.        Date   Time Address  Patient Id
0        1  2023-08-14  10:48  Rajura  RajMah0001
1        2  2023-08-14  11:04  Rajura  RajMah0002
2        3  2023-08-14  10:00   Tarsa  RajMah0003
3        4  2023-08-14  10:56   Aheri  RajMah0004
4        5  2023-08-14  10:42   Tarsa  RajMah0005

In [36]:
dt2["Address"] = dt["Address"]
dt2.head()

   Sr. No.        Date   Time Address
0        1  2023-08-14  10:30  Rajura
1        2  2023-08-14  11:10  Rajura
2        3  2023-08-14  10:00   Tarsa
3        4  2023-08-14  11:18   Aheri
4        5  2023-08-14  10:39   Tarsa

In [37]:
dt2.isna().sum()

Sr. No.    0
Date       0
Time       0
Address    0
dtype: int64

Assigning <b>Time</b> field

Saving the updated dataset <b>Measuring Parameter_5000.xlsx</b>

In [38]:
dt2.to_excel("DataSets/Measuring Parameter_5000.xlsx",sheet_name="Measuring Parameter",index=False)

#### Patient Id
Coppying <b>Patient Id</b> from 1st sheet data

In [39]:
dt2["Patient Id"]=dt["Patient Id"]
dt2.tail()

      Sr. No.        Date   Time   Address  Patient Id
4995     4996  2023-12-29  15:48     Aheri  RajMah4996
4996     4997  2023-12-29  15:34     Bamni  RajMah4997
4997     4998  2023-12-29  15:39    digras  RajMah4998
4998     4999  2023-12-29  15:24  Etapalli  RajMah4999
4999     5000  2023-12-29  15:39  Etapalli  RajMah5000

#### Height, Weight
Generating random values <b>from 80.00 to 105.00 for Height</b> and <b>for Weight it is from 9.00 to 20.00</b>

In [ ]:
height=[rnd.randint(8000,10500)/100 for i in range(5000)]
weight=[rnd.randint(900,2000)/100 for i in range(5000)]

Filling <b>height</b> and <b>Weight</b> field

In [ ]:
dt2.loc[:,"Height (cm)"]=height
dt2.loc[:,"Weight (kg)"]=weight
dt2.tail(11)

Calculating BMI = Weight/Height**2

In [ ]:
bmi=round(dt2["Weight (kg)"]/(dt2["Height (cm)"]/100)**2,2)
dt2.loc[:,"BMI"]=bmi
dt2.tail()

Saving the updated dataset <b>Measuring Parameter_5000.xlsx</b>

In [ ]:
dt2.to_excel("DataSets/Measuring Parameter_5000.xlsx",sheet_name="Measuring Parameter",index=False)

#### 	ForeArm Size (cm)
Generating random values from 7.00 to 15.00

In [ ]:
arm = [rnd.randint(700,1500)/100 for i in range(5000)]

Filling <b>ForeArm Size (cm)</b> field

In [ ]:
dt2["ForeArm Size (cm)"]=arm
dt2.head()

##### Categorize Malnourishement by Forearm size
arm size  0 - 11.5cm == SAM<br>
          11.6 - 12.4cm == MAM<br>
          12.5cm - 13.4     == EU<br>
          13.5 - 15 NAM<br>

In [ ]:
com = []
for i in arm:
    if(i<=11.55):
        com.append("SAM")
    elif(11.55<i and i<=12.45):
        com.append("MAM")
    elif(12.45<i and i<=13.35):
        com.append("EU")
    elif(13.35<i):
        com.append("NAN")
dt2["Category of Malnourished Based on Arm Size"]=com
dt2.tail()

#### HeartBeat Rate
generating data for heart beat rate ranging from 70 to 160

In [ ]:
hb= [rnd.randint(70,160) for i in range(5000)]

Fiiling <b>HeartBeat Rate</b>

In [ ]:
dt2["HeartBeat Rate"] = hb
dt2.head()

Rearrenging the dataset

In [ ]:
dt2=dt2[["Sr. No.","Time","Date","Patient Id","Height (cm)","Weight (kg)","ForeArm Size (cm)","Category of Malnourished Based on Arm Size","BMI","HeartBeat Rate"]]
dt2.head(8)

Saving the updated dataset at <b>Measuring Parameter_5000.xlsx</b>

In [ ]:
dt2.to_excel("DataSets/Measuring Parameter_5000.xlsx",sheet_name="Measuring Parameter",index=False)

Formatting Date as day-month-year

In [ ]:
date = dt2["Date"].to_list()
date1=[]
for i in date:
    date1.append("-".join(i.split("-")[::-1]))
dt2["Date"] = date1
dt2.tail()

Finally Save the third sheet at <b>Measuring Parameter_5000.xlsx</b>

In [ ]:
dt2.to_excel("DataSets/Measuring Parameter_5000.xlsx",sheet_name="Measuring Parameter",index=False)

# For Sheet_3, Result Output
Coppying <b>Sr. No.</b> , <b>Patient Id</b> , <b>Time</b> and  <b>Date</b> from previous data sheet

In [ ]:
dt3=pd.DataFrame({"Sr. No.":dt2["Sr. No."],"Patient Id":dt2["Patient Id"],"Time":dt2["Time"],"Date":dt2["Date"]})
dt3.head()

Saving the created data set at <b>Result Output_5000.xlsx</b>

In [ ]:
dt3.to_excel("DataSets/Result Output_5000.xlsx",sheet_name="Result Output",index=False)

#### Malnourished or Not
If one has <b>BMI</b> greater than 18.5 the he/she is not Malnourished otherwise Not</br>
Making the field

In [ ]:
malnr=dt2["BMI"]<=18.5
malnr=["Yes" if i else "No" for i in malnr]
dt3["Malnourished or Not"]=malnr
dt3.tail()

#### Type of Malnourishment
Categorizing type of Malnourishment accoding to following conditions

In [ ]:
bmi = dt2["BMI"].to_list()
tm=[]
for i in bmi:
    if(i< 18.5):
        tm.append("Under Weight")
    elif(18.5 <=i and i<24.9):
        tm.append("Normal")
    elif(24.9 <=i and i <29.9):
        tm.append("Over weight")
    elif(29.9 <= i and i<35):
        tm.append("Obesity")
dt3["Type of Malnourishment"]=tm
dt3.head()

Saving the updated dataset

In [ ]:
dt3.to_excel("DataSets/Result Output_5000.xlsx",sheet_name="Result Output",index=False)

Now we have 3 files
<ol>
    <li>Patient Record_5000.xlsx</li>
    <li>Measuring Parameter_5000.xlsx</li>
    <li>Result Output_5000.xlsx</li>
</ol>
at "./DataSets"  are required datasets